Config/Documents/РасходныйОрдерФондовый.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РасходныйОрдерФондовый</Name>
			<BasedOn>
				<xr:Item>Document.ЗаявкаОбоснованиеЗакупкиМалогоОбъема</xr:Item>
				<xr:Item>Document.РешениеОКомандировании</xr:Item>
				<xr:Item>Document.РешениеОКомпенсацииРасходовДляКрайнегоСевера</xr:Item>
				<xr:Item>Document.ЗаявкаОбоснованиеЗакупкиМалогоОбъемаЧерезПодотчетноеЛицо</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеДокументы</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Аннулирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выдать</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РешениеОКомпенсацииРасходовДляКрайнегоСевера</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияКассы</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаОбоснованиеЗакупкиМалогоОбъема</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаОбоснованиеЗакупкиМалогоОбъемаЧерезПодотчетноеЛицо</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризационнаяОписьБСО</v8:Type>
						<v8:Type>cfg:DocumentRef.РешениеОКомандировании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАналитическогоУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЦелевогоНазначения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелевыеНазначенияКассовыхОрдеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСчет</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплачено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоДокументу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАннулирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписиКассира</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписиГлБухгалтера</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расшифровка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДенежногоДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДенежныхДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДенежныйДокумент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДенежныеДокументы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Enums/ВидыОтклоненийВИнвентаризацииНФА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОтклоненийВИнвентаризацииНФА</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Излишки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеАктивы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обесценение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтоимости</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/СпособыОбеспеченияКомандировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыОбеспеченияКомандировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АвансПодотчетномуЛицу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закупка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаСчетПринимающейСтороны</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозмещениеПоФакту</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/СпособыВыдачиДенежныхСредствПодотчетномуЛицу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыВыдачиДенежныхСредствПодотчетномуЛицу</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличными</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичными</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеДокументы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/МестаХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>МестаХранения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Documents/РасходныйОрдерФондовый/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс	
	
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.РасходныйКассовыйОрдер";
	КомандаПечати.Идентификатор		= "КО2";
	КомандаПечати.Представление		= НСтр("ru = 'Расходный кассовый ордер'");
	КомандаПечати.Порядок			= 1;
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"КО2") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"КО2","РКО",ПечатьКО2(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
		
КонецПроцедуры // Печать()

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
// Параметры
//  Ссылка  - ДокументСсылка.РасходныйОрдерФондовый - ссылка на текущий документ
//  ДополнительныеСвойства  - Структура - Структура данных для подсистемы печати
//
Процедура ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст="ВЫБРАТЬ
	             |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	             |	РасходныйОрдерФондовыйРасшифровка.Ссылка.Дата КАК Период,
	             |	РасходныйОрдерФондовыйРасшифровка.Ссылка.Организация,
	             |	ВЫБОР
	             |		КОГДА РасходныйОрдерФондовыйРасшифровка.Ссылка.Подразделение.ВедетсяКассоваяКнига
	             |			ТОГДА РасходныйОрдерФондовыйРасшифровка.Ссылка.Подразделение
	             |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.Пустаяссылка)
	             |	КОНЕЦ КАК Подразделение,
	             |	РасходныйОрдерФондовыйРасшифровка.ДенежныйДокумент,
	             |	СУММА(РасходныйОрдерФондовыйРасшифровка.Количество) КАК Количество,
	             |	СУММА(РасходныйОрдерФондовыйРасшифровка.Сумма) КАК Сумма,
	             |	РасходныйОрдерФондовыйРасшифровка.КФО,
	             |	РасходныйОрдерФондовыйРасшифровка.ВидДенежногоДокумента
	             |ИЗ
	             |	Документ.РасходныйОрдерФондовый.Расшифровка КАК РасходныйОрдерФондовыйРасшифровка
	             |ГДЕ
	             |	РасходныйОрдерФондовыйРасшифровка.Ссылка = &Ссылка
	             |	И РасходныйОрдерФондовыйРасшифровка.Ссылка.Оплачено
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	РасходныйОрдерФондовыйРасшифровка.Ссылка.Организация,
	             |	РасходныйОрдерФондовыйРасшифровка.ДенежныйДокумент,
	             |	РасходныйОрдерФондовыйРасшифровка.Ссылка.Дата,
	             |	РасходныйОрдерФондовыйРасшифровка.КФО,
	             |	РасходныйОрдерФондовыйРасшифровка.ВидДенежногоДокумента,
	             |	ВЫБОР
	             |		КОГДА РасходныйОрдерФондовыйРасшифровка.Ссылка.Подразделение.ВедетсяКассоваяКнига
	             |			ТОГДА РасходныйОрдерФондовыйРасшифровка.Ссылка.Подразделение
	             |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.Пустаяссылка)
	             |	КОНЕЦ";
				 
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ДенежныеДокументыДвижения = Запрос.Выполнить().Выгрузить();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	
	ТаблицыДляДвижений.Вставить("ДенежныеДокументы",  ДенежныеДокументыДвижения);
	
КонецПроцедуры //ИнициализироватьДанныеДокумента()

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК ЭтотСписок
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|	ПО ЭтотСписок.Контрагент.ЮридическоеФизическоеЛицо = Пользователи.ФизическоеЛицо
	|
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Пользователи.Ссылка, NULL КАК ИСТИНА)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Формирует таблицу разделителей документов для целей формирования текущего документа по данным инвентаризационной описи.
//
// Параметры:
//  ДокОснование - ДокументСсылка.ИнвентаризационнаяОписьНФА - документ, по данным которого заполняется текущий документ
//  СсылкаЦелевогоДокумента - ДокументСсылка.РасходныйОрдерФондовый -
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица разделителей с полями:
//   * ЦМООтправитель - СправочникСсылка.ЦМО
//   * ПодразделениеОтправитель - СправочникСсылка.Подразделения
Функция ТаблицаРазделителейДокументов(ДокОснование, СсылкаЦелевогоДокумента = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Документы.ИнвентаризационнаяОписьБСО.ЗапросДанныхДокументаИнвентаризации(Запрос, ДокОснование, СсылкаЦелевогоДокумента);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеИнвентаризации.ДокументИнвентаризации КАК ДокументИнвентаризации
	|ИЗ
	|	ДанныеДокументаИнвентаризации КАК ДанныеИнвентаризации
	|ГДЕ
	|	ДанныеИнвентаризации.ДокументИнвентаризации = &Ссылка
	|	И ДанныеИнвентаризации.ВидОбъекта = 12
	|	И ДанныеИнвентаризации.КоличествоНедостачаНеПодтверждено <> 0";
		
	Запрос.УстановитьПараметр("Ссылка", ДокОснование);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

// Формирует текст запроса для получения НФА, уже отработанных данным документом
// по инвентаризации
//
// Возвращаемое значение:
// - Строка - текст запроса
Функция ТекстЗапроса_НФАОтработанныеПоИнвентаризации() Экспорт
	Возврат
	"ВЫБРАТЬ
	|	РКО.Ссылка КАК Ссылка,
	|	РКО.ДокументОснование,
	|	СоставДокумента.ДенежныйДокумент,
	|	ЗНАЧЕНИЕ(Справочник.СерииБСО.ПустаяСсылка) КАК СерияБСО,
	|	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОтклоненийВИнвентаризацииНФА.Недостача),
	|	ЗНАЧЕНИЕ(Справочник.МестаХранения.ПустаяСсылка),
	|	СоставДокумента.Количество,
	|	0 КАК НомерНачальный,
	|	0 КАК НомерКонечный
	|ИЗ
	|	Документ.РасходныйОрдерФондовый КАК РКО
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерФондовый.Расшифровка КАК СоставДокумента
	|		ПО РКО.Ссылка = СоставДокумента.Ссылка
	|ГДЕ
	|	РКО.ДокументОснование В(&ДокументыИнвентаризации)
	|	И НЕ РКО.ПометкаУдаления
	|	И РКО.Ссылка <> &РасходныйОрдерФондовыйСсылка";
КонецФункции

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПечатьДокумента

// Функция формирует печатные формы документов
//
// Параметры
//  МассивОбъктов  - Массив - Массив ссылок на объекты которые нужно распечатать
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//
// Возвращаемое значение:
//   ТабличныйДокумент   - Результирующая таблица, содржащая печатный формы документов
//
Функция ПечатьКО2(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_КО2";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_КО2");
	
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	РасходныйОрдерФондовый.Ссылка,
	             |	РасходныйОрдерФондовый.Номер КАК Номер,
	             |	РасходныйОрдерФондовый.Дата КАК ДатаДокумента,
	             |	РасходныйОрдерФондовый.Организация,
	             |	РасходныйОрдерФондовый.Подразделение,
	             |	РасходныйОрдерФондовый.ПодразделениеКор.Код КАК КодПодразделения,
	             |	РасходныйОрдерФондовый.СуммаДокумента,
	             |	РасходныйОрдерФондовый.ПодразделениеКор,
	             |	РасходныйОрдерФондовый.Счет,
	             |	РасходныйОрдерФондовый.КорСчет,
	             |	РасходныйОрдерФондовый.Выдать КАК ФИОПолучателя,
	             |	РасходныйОрдерФондовый.Основание,
	             |	РасходныйОрдерФондовый.Приложение,
	             |	РасходныйОрдерФондовый.Руководитель,
	             |	РасходныйОрдерФондовый.ГлБухгалтер,
	             |	РасходныйОрдерФондовый.Кассир,
	             |	РасходныйОрдерФондовый.ПоДокументу КАК РеквизитыДокументаУдостоверяющегоЛичность,
	             |	РасходныйОрдерФондовый.Организация.Наименование КАК НаименованиеОрганизации,
	             |	РасходныйОрдерФондовый.Подразделение.Наименование КАК НаименованиеПодразделения,
	             |	РасходныйОрдерФондовый.Организация.Префикс КАК ПрефиксОрганизации,
	             |	ВЫБОР
	             |		КОГДА ВложенныйЗапрос.КоличествоКФО = 1
	             |			ТОГДА ВложенныйЗапрос.КФО
	             |		ИНАЧЕ ""0""
	             |	КОНЕЦ КАК КФО,
	             |	РасходныйОрдерФондовый.КодЦелевогоНазначения.Код КАК КодЦелевогоНазначения,
	             |	РасходныйОрдерФондовый.КодАналитическогоУчета,
	             |	РасходныйОрдерФондовый.Организация.КодОКПО КАК ОрганизацияПоОКПО
	             |ИЗ
	             |	Документ.РасходныйОрдерФондовый КАК РасходныйОрдерФондовый
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			РасходныйОрдерФондовыйРасшифровка.Ссылка КАК Ссылка,
	             |			МАКСИМУМ(РасходныйОрдерФондовыйРасшифровка.КФО) КАК КФО,
	             |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РасходныйОрдерФондовыйРасшифровка.КФО) КАК КоличествоКФО
	             |		ИЗ
	             |			Документ.РасходныйОрдерФондовый.Расшифровка КАК РасходныйОрдерФондовыйРасшифровка
	             |		ГДЕ
	             |			РасходныйОрдерФондовыйРасшифровка.Ссылка В(&МассивОбъектов)
	             |		
	             |		СГРУППИРОВАТЬ ПО
	             |			РасходныйОрдерФондовыйРасшифровка.Ссылка) КАК ВложенныйЗапрос
	             |		ПО РасходныйОрдерФондовый.Ссылка = ВложенныйЗапрос.Ссылка
	             |ГДЕ
	             |	РасходныйОрдерФондовый.Ссылка В(&МассивОбъектов)
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Номер";
	Запрос.УстановитьПараметр("МассивОбъектов",МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;

	Пока Шапка.Следующий() Цикл

		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
    	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		
		ОбластьШапка.Параметры.Заполнить(Шапка);
		СтруктураОбластьШапка = Новый Структура("НомерДокумента,Сумма,СуммаПрописью,ПредставлениеОрганизации,ПредставлениеПодразделения,ДебетСубСчет,КредитСубСчет,ФИОРуководителя,ФИОГлавногоБухгалтера,ФИОКассира");
		СтруктураОбластьШапка.НомерДокумента = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(Шапка.Ссылка,Шапка.Номер);
		
		//Сумма = Формат(Шапка.СуммаДокумента, "ЧЦ=15; ЧДЦ=2");
		//
		СтруктураОбластьШапка.Сумма = Шапка.СуммаДокумента;
		СтруктураОбластьШапка.СуммаПрописью=ОбщегоНазначенияБГУ.СформироватьСуммуПрописью(Шапка.СуммаДокумента,Константы.ВалютаРегламентированногоУчета.Получить());
		
		СтруктураОбластьШапка.ПредставлениеОрганизации=Шапка.НаименованиеОрганизации;
		СтруктураОбластьШапка.ПредставлениеПодразделения=Шапка.НаименованиеПодразделения;
		
		СтруктураОбластьШапка.ДебетСубСчет = БухгалтерскийУчетПовтИсп.ПолучитьПредставлениеСчета(Шапка.КорСчет, , Шапка.КФО);
		СтруктураОбластьШапка.КредитСубСчет = БухгалтерскийУчетПовтИсп.ПолучитьПредставлениеСчета(Шапка.Счет, , Шапка.КФО);
		
		СтруктураОбластьШапка.Вставить("КодЦелевогоНазначения", СокрЛП(Шапка.КодЦелевогоНазначения));
		
		СтруктураОбластьШапка.ФИОРуководителя = Справочники.Контрагенты.ФамилияИО(Шапка.Руководитель, Истина, Шапка.ДатаДокумента);
		СтруктураОбластьШапка.ФИОГлавногоБухгалтера = Справочники.Контрагенты.ФамилияИО(Шапка.ГлБухгалтер, Истина, Шапка.ДатаДокумента);
		СтруктураОбластьШапка.ФИОКассира = Справочники.Контрагенты.ФамилияИО(Шапка.Кассир, Истина, Шапка.ДатаДокумента);
		ОбластьШапка.Параметры.Заполнить(СтруктураОбластьШапка);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		ТабличныйДокумент.Область(2+НомерСтрокиНачало-1, 2, 2+НомерСтрокиНачало-1, 4).Объединить();
		Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2);
		ТабличныйДокумент.Область(2+НомерСтрокиНачало-1, 2, 2+НомерСтрокиНачало-1, 4).Обвести(Линия, Линия, Линия, Линия);
		ТабличныйДокумент.Область(2+НомерСтрокиНачало-1, 2, 2+НомерСтрокиНачало-1, 4).Текст                   = "Ф О Н Д О В Ы Й";
		ЦветПечати                                              = Новый Цвет(83,114,187); 
		ТабличныйДокумент.Область(2+НомерСтрокиНачало-1, 2, 2+НомерСтрокиНачало-1, 4).ЦветТекста              = ЦветПечати;
		ТабличныйДокумент.Область(2+НомерСтрокиНачало-1, 2, 2+НомерСтрокиНачало-1, 4).ЦветРамки               = ЦветПечати;
		ТабличныйДокумент.Область(2+НомерСтрокиНачало-1, 2, 2+НомерСтрокиНачало-1, 4).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ТабличныйДокумент.Область(2+НомерСтрокиНачало-1, 2, 2+НомерСтрокиНачало-1, 4).ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
		ЖирныйШрифт                                             = Новый Шрифт(ТабличныйДокумент.Область(2+НомерСтрокиНачало-1, 2, 2+НомерСтрокиНачало-1, 4).Шрифт,, 11, Истина);
		ТабличныйДокумент.Область(2+НомерСтрокиНачало-1, 2, 2+НомерСтрокиНачало-1, 4).Шрифт                   = ЖирныйШрифт;
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		                                               НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеДокумента

Функция ЗаполнитьНаОсновании(Знач Основание, Объект, ОписаниеОшибки = "") Экспорт
	
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		ОписаниеОшибки = НСтр("ru='Не заполнен документ-основание'");
		Возврат Ложь;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ТипДанныхЗаполнения = ТипЗнч(Основание);
	
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.РешениеОКомандировании") Тогда
		ЗаполнитьДокументНаОснованииРешенияОКомандировании(Основание, Объект);
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.РешениеОКомпенсацииРасходовДляКрайнегоСевера") Тогда
		ЗаполнитьДокументНаОснованииРешенияОКомпенсации(Основание, Объект);
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаявкаОбоснованиеЗакупкиМалогоОбъема")
		ИЛИ ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаявкаОбоснованиеЗакупкиМалогоОбъемаЧерезПодотчетноеЛицо") Тогда
		ЗаполнитьДокументНаОснованииЗаявкиОбоснованияЗакупкиМалогоОбъема(Основание, Объект, Отказ, ОписаниеОшибки);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ЗаполнитьДокументНаОснованииРешенияОКомандировании(ДокументОснование, Объект)
	
	Объект.ДокументОснование = ДокументОснование;
	
	ЗаполнитьЗначенияСвойств(Объект, ДокументОснование,"Организация, ИФО, Подразделение");
	
	Объект.КорСчет 			= БухгалтерскийУчет.СчетПоКоду("208.00", ТекущаяДатаСеанса());
	Объект.Счет 			= БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("201.35");
	Объект.ПодразделениеКор = ДокументОснование.Подразделение;
	Объект.Контрагент 		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование.Сотрудник, "Контрагент");
	Объект.Договор 			= ДокументОснование.ОснованиеПринятияОбязательства;
	
	ЗаполнитьДанныеКонтрагента(Объект.Контрагент, Объект.Выдать, Объект.ПоДокументу);
	
	ТаблицаДляЗаполнения = ДокументОснование.ФинансовоеОбеспечение.Выгрузить(,"КФО, КПС, Сумма");
	ТаблицаДляЗаполнения.Очистить();
	
	МассивТЧ = Новый Массив;
	МассивТЧ.Добавить("УсловияПроезда");
	МассивТЧ.Добавить("УсловияПроживания");
	МассивТЧ.Добавить("ПрочиеРасходы");
	
	Для Каждого ТЧ Из МассивТЧ Цикл
		Для Каждого СтрокаТЧ Из ДокументОснование[ТЧ] Цикл
			Если СтрокаТЧ.СпособОбеспечения <> ПредопределенноеЗначение("Перечисление.СпособыОбеспеченияКомандировки.ВыдачаДенежныхДокументов") Тогда
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ТаблицаДляЗаполнения.Добавить(), СтрокаТЧ);
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого СтрокаОснования Из ТаблицаДляЗаполнения Цикл
		
		Если СтрокаОснования.Сумма <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Объект.Расшифровка.Добавить(), СтрокаОснования);
		
	КонецЦикла;
	
	Объект.СуммаДокумента = Объект.Расшифровка.Итог("Сумма");
	
КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииРешенияОКомпенсации(ДокументОснование, Объект)
	
	Объект.ДокументОснование = ДокументОснование;
	
	ЗаполнитьЗначенияСвойств(Объект, ДокументОснование,"Организация, ИФО, Подразделение");
	
	Объект.КорСчет 			= БухгалтерскийУчет.СчетПоКоду("208.00", ТекущаяДатаСеанса());
	Объект.Счет 			= БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("201.35");
	Объект.ПодразделениеКор = ДокументОснование.Подразделение;
	Объект.Контрагент 		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование.Сотрудник, "Контрагент");
	Объект.Договор 			= ДокументОснование.ОснованиеПринятияОбязательства;
	
	ЗаполнитьДанныеКонтрагента(Объект.Контрагент, Объект.Выдать, Объект.ПоДокументу);
	
	ТаблицаДляЗаполнения = ДокументОснование.ФинансовоеОбеспечение.Выгрузить(,"КФО, КПС, Сумма");
	ТаблицаДляЗаполнения.Очистить();
	
	МассивТЧ = Новый Массив;
	МассивТЧ.Добавить("УсловияПроезда");
	МассивТЧ.Добавить("ПрочиеРасходы");
	
	Для Каждого ТЧ Из МассивТЧ Цикл
		Для Каждого СтрокаТЧ Из ДокументОснование[ТЧ] Цикл
			Если СтрокаТЧ.СпособОбеспечения <> ПредопределенноеЗначение("Перечисление.СпособыОбеспеченияКомандировки.ВыдачаДенежныхДокументов") Тогда
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ТаблицаДляЗаполнения.Добавить(), СтрокаТЧ);
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого СтрокаОснования Из ТаблицаДляЗаполнения Цикл
		
		Если СтрокаОснования.Сумма <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Объект.Расшифровка.Добавить(), СтрокаОснования);
		
	КонецЦикла;
	
	Объект.СуммаДокумента = Объект.Расшифровка.Итог("Сумма");
	
КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииЗаявкиОбоснованияЗакупкиМалогоОбъема(ДокументОснование, Объект, Отказ, ОписаниеОшибки)
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаявкаОбоснованиеЗакупкиМалогоОбъемаЧерезПодотчетноеЛицо")
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "СпособВыдачиДенежныхСредств")
			<> Перечисления.СпособыВыдачиДенежныхСредствПодотчетномуЛицу.ДенежныеДокументы Тогда
		Отказ = Истина;
		ОписаниеОшибки = НСтр("ru='Неподходящий способ выдачи денежных средств'");
		Возврат;
	КонецЕсли;
	
	Объект.ДокументОснование = ДокументОснование;
	
	ЗаполнитьЗначенияСвойств(Объект, ДокументОснование, "Организация, ИФО, Подразделение");
	
	КЭКОснования = ДокументОснование.ТоварыРаботыУслуги.ВыгрузитьКолонку("КЭК");
	КЭКОснования = ОбщегоНазначенияКлиентСервер.СвернутьМассив(КЭКОснования);
	
	Если КЭКОснования.Количество() = 1 Тогда
		Объект.КорСчет = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
			КЭКОснования[0], "208.00", , ТекущаяДатаСеанса(), Объект.Организация, Объект.ИФО);
	Иначе
		Объект.КорСчет = БухгалтерскийУчет.СчетПоКоду("208.00", ТекущаяДатаСеанса());
	КонецЕсли;
	Объект.Счет = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("201.35");
	Объект.ПодразделениеКор = ДокументОснование.Подразделение;
	Объект.Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование.ПодотчетноеЛицо, "Контрагент");
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаявкаОбоснованиеЗакупкиМалогоОбъемаЧерезПодотчетноеЛицо") Тогда
		Объект.Договор = ДокументОснование.ОснованиеПринятияОбязательства;
	Иначе
		Объект.Договор = ДокументОснование.Договор;
	КонецЕсли;
	
	ЗаполнитьДанныеКонтрагента(Объект.Контрагент, Объект.Выдать, Объект.ПоДокументу);
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаявкаОбоснованиеЗакупкиМалогоОбъема") Тогда
		ТаблицаДляЗаполнения = ДокументОснование.ТоварыРаботыУслуги.Выгрузить(,"КФО, КПС, Сумма, Количество");
	Иначе
		ТаблицаДляЗаполнения = ДокументОснование.ТоварыРаботыУслуги.Выгрузить(,"КФО, КПС, Сумма, Количество, ДенежныйДокумент");
	КонецЕсли;
	ТаблицаДляЗаполнения.Очистить();
	
	Для Каждого СтрокаТЧ Из ДокументОснование["ТоварыРаботыУслуги"] Цикл
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаявкаОбоснованиеЗакупкиМалогоОбъема")
			И СтрокаТЧ.СпособОбеспечения <> ПредопределенноеЗначение("Перечисление.СпособыОбеспеченияКомандировки.ВыдачаДенежныхДокументов") Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ТаблицаДляЗаполнения.Добавить(), СтрокаТЧ);
	КонецЦикла;
	
	Для Каждого СтрокаОснования Из ТаблицаДляЗаполнения Цикл
		
		Если СтрокаОснования.Сумма <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.Расшифровка.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОснования);
		
		Если ЗначениеЗаполнено(НоваяСтрока.ДенежныйДокумент) Тогда
			НоваяСтрока.ВидДенежногоДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				НоваяСтрока.ДенежныйДокумент, "Владелец");
		КонецЕсли;
		
	КонецЦикла;
	
	Объект.СуммаДокумента = Объект.Расшифровка.Итог("Сумма");
	
КонецПроцедуры

// Заполнить по инвентаризации 0510465.
// 
// Параметры:
//  ДокументИнвентаризации - ДокументСсылка.ИнвентаризационнаяОписьБСО - Документы инвентаризации
//  ЗаполняемыйДокумент - ДокументОбъект.РасходныйОрдерФондовый, ДанныеФормыСтруктура - Заполняемый документ
Процедура ЗаполнитьПоИнвентаризации0510465(ДокументИнвентаризации, ЗаполняемыйДокумент) Экспорт
	Запрос = Новый Запрос;
	Документы.ИнвентаризационнаяОписьБСО.ЗапросДанныхДокументаИнвентаризации(Запрос, ДокументИнвентаризации);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокументаИнвентаризации.СчетУчета КАК СчетУчета,
	|	ДанныеДокументаИнвентаризации.ВидДенежногоДокумента КАК ВидДенежногоДокумента,
	|	ДанныеДокументаИнвентаризации.ДенежныйДокумент КАК ДенежныйДокумент,
	|	ДанныеДокументаИнвентаризации.КФО КАК КФО,
	|	ДанныеДокументаИнвентаризации.КоличествоНедостачаНеПодтверждено КАК Количество,
	|	ДанныеДокументаИнвентаризации.СуммаНедостачаНеПодтверждено КАК Сумма
	|ИЗ
	|	ДанныеДокументаИнвентаризации КАК ДанныеДокументаИнвентаризации
	|ГДЕ
	|	(ДанныеДокументаИнвентаризации.КоличествоНедостачаНеПодтверждено <> 0
	|			ИЛИ ДанныеДокументаИнвентаризации.СуммаНедостачаНеПодтверждено <> 0)
	|	И ДанныеДокументаИнвентаризации.ВидОбъекта = 12";
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗаполняемыйДокумент.СуммаДокумента = 0;
	Пока Выборка.Следующий() Цикл
		ЗаполняемыйДокумент.Счет = Выборка.СчетУчета;
		НоваяСтрока = ЗаполняемыйДокумент.Расшифровка.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		ЗаполняемыйДокумент.СуммаДокумента = ЗаполняемыйДокумент.СуммаДокумента + НоваяСтрока.Сумма;
	КонецЦикла;

КонецПроцедуры

// Получает данные о контрагенте. Фамилия, имя, отчество и документ физического лица.
//
Процедура ЗаполнитьДанныеКонтрагента(Контрагент, Выдать, ПоДокументу) Экспорт
	
	ДанныеКонтрагента = Новый Структура("СсылкаНаОбъект, НаименованиеПолное, Фамилия, Имя, Отчество, ВыдатьКому, УдостоверениеЛичности", Контрагент); 
	Справочники.Контрагенты.ПолучитьДанныеКонтрагента(ДанныеКонтрагента);
	Если ЗначениеЗаполнено(ДанныеКонтрагента.ВыдатьКому) Тогда
		Выдать = ДанныеКонтрагента.ВыдатьКому;
	ИначеЕсли ЗначениеЗаполнено(ДанныеКонтрагента.Фамилия) или
		ЗначениеЗаполнено(ДанныеКонтрагента.Имя) или
		ЗначениеЗаполнено(ДанныеКонтрагента.Отчество) Тогда
		Выдать = "" + ДанныеКонтрагента.Фамилия+" "+ДанныеКонтрагента.Имя+" "+ДанныеКонтрагента.Отчество;
	Иначе
		Выдать = ДанныеКонтрагента.НаименованиеПолное;
	КонецЕсли;
	ПоДокументу = ДанныеКонтрагента.УдостоверениеЛичности;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
